import React from 'react'
import { MapPinIcon, PhoneIcon } from '@heroicons/react/24/solid'
import Image from 'next/image'
import logo from '../../../public/images/logo.png'

function Footer() {
    return (
        <>
            <footer className='pt-12 xl:pt-[150px] border-b'>
                <div className="container pb-12 xl:pb-[100px]">
                    <div className='grid md:grid-cols-2 xl:grid-cols-3 gap-x-20 gap-y-10'>
                        {/* Logo & Desc section */}
                        <div className='md:col-span-2 xl:col-span-1'>
                            {/* <Image
                                src={logo}
                                width={130}
                                height={50}
                                alt="Logo"
                                className='pb-3'
                            >
                            </Image> */}
                            <Image
                                src={logo}
                                width={100}
                                height={50}
                                alt="Logo"
                                className='pb-5'
                            >
                            </Image>
                            {/* <br /> */}
                            {/* <p className='tracking-normal md:tracking-tighter font-DanaMedium text-base md:text-lg'>
                                البرز مفتخر است که بیش از 25  سال با برگزاری دوره های خاص IT هم در زمینه شبکه و برنامه نویسی با بهره گیری از مجرب ترین اساتید ایران، خدمات شایانی را جهت تربیت و عرضه نیروی کار ماهر نموده است.
                            </p> */}
                            <div className="max-w-lg text-white text-lg text-justify overflow-hidden">
                                <p className="break-words overflow-wrap">
                                    البرز مفتخر است که بیش از 25 سال با برگزاری دوره های خاص IT هم در زمینه شبکه و برنامه نویسی با بهره گیری از مجرب ترین اساتید ایران، خدمات شایانی را جهت تربیت و عرضه نیروی کار ماهر نموده است.
                                </p>
                            </div>
                        </div>
                        {/* Footer contact section */}
                        <div>
                            <div className='font-DanaMedium'>
                                <h2 className='font-MorabbaBold'>ارتباط با ما</h2>
                                <br />
                                <div className='flex items-start gap-2 text-base md:text-lg'>
                                    <div className='w-6'>
                                        <MapPinIcon className='w-6 text-accent h-full' />
                                    </div>
                                    آدرس: تبریز، شهرک ولیعصر، خیابان اوحدی، جنب شهر کتاب، ساختمان رهبری
                                </div>
                                <div className='flex items-start mt-1 gap-2'>
                                    <div className='flex gap-2'>
                                        <PhoneIcon className='w-5 text-accent text-base md:text-lg' />
                                        <p> شماره تماس ها:</p>
                                    </div>

                                    <span>
                                        <p dir='ltr'>04133323879</p>
                                        <p dir='ltr'>04133323821</p>
                                    </span>

                                </div>
                            </div>


                        </div>
                        {/* Quick links section */}
                        <div>
                            <div>
                                <h2 className='font-MorabbaBold'>شبکه اجتماعی</h2>
                                <br />
                                <div className='font-DanaMedium text-base md:text-lg space-y-2'>
                                    <a href='https://www.instagram.com/alborz_institute' className='flex items-center gap-2 hover:text-accent transition-all'>
                                        <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 24 24" fill="currentColor" className='text-accent w-5'><path d="M13.0281 2.00073C14.1535 2.00259 14.7238 2.00855 15.2166 2.02322L15.4107 2.02956C15.6349 2.03753 15.8561 2.04753 16.1228 2.06003C17.1869 2.1092 17.9128 2.27753 18.5503 2.52503C19.2094 2.7792 19.7661 3.12253 20.3219 3.67837C20.8769 4.2342 21.2203 4.79253 21.4753 5.45003C21.7219 6.0867 21.8903 6.81337 21.9403 7.87753C21.9522 8.1442 21.9618 8.3654 21.9697 8.58964L21.976 8.78373C21.9906 9.27647 21.9973 9.84686 21.9994 10.9723L22.0002 11.7179C22.0003 11.809 22.0003 11.903 22.0003 12L22.0002 12.2821L21.9996 13.0278C21.9977 14.1532 21.9918 14.7236 21.9771 15.2163L21.9707 15.4104C21.9628 15.6347 21.9528 15.8559 21.9403 16.1225C21.8911 17.1867 21.7219 17.9125 21.4753 18.55C21.2211 19.2092 20.8769 19.7659 20.3219 20.3217C19.7661 20.8767 19.2069 21.22 18.5503 21.475C17.9128 21.7217 17.1869 21.89 16.1228 21.94C15.8561 21.9519 15.6349 21.9616 15.4107 21.9694L15.2166 21.9757C14.7238 21.9904 14.1535 21.997 13.0281 21.9992L12.2824 22C12.1913 22 12.0973 22 12.0003 22L11.7182 22L10.9725 21.9993C9.8471 21.9975 9.27672 21.9915 8.78397 21.9768L8.58989 21.9705C8.36564 21.9625 8.14444 21.9525 7.87778 21.94C6.81361 21.8909 6.08861 21.7217 5.45028 21.475C4.79194 21.2209 4.23444 20.8767 3.67861 20.3217C3.12278 19.7659 2.78028 19.2067 2.52528 18.55C2.27778 17.9125 2.11028 17.1867 2.06028 16.1225C2.0484 15.8559 2.03871 15.6347 2.03086 15.4104L2.02457 15.2163C2.00994 14.7236 2.00327 14.1532 2.00111 13.0278L2.00098 10.9723C2.00284 9.84686 2.00879 9.27647 2.02346 8.78373L2.02981 8.58964C2.03778 8.3654 2.04778 8.1442 2.06028 7.87753C2.10944 6.81253 2.27778 6.08753 2.52528 5.45003C2.77944 4.7917 3.12278 4.2342 3.67861 3.67837C4.23444 3.12253 4.79278 2.78003 5.45028 2.52503C6.08778 2.27753 6.81278 2.11003 7.87778 2.06003C8.14444 2.04816 8.36564 2.03847 8.58989 2.03062L8.78397 2.02433C9.27672 2.00969 9.8471 2.00302 10.9725 2.00086L13.0281 2.00073ZM12.0003 7.00003C9.23738 7.00003 7.00028 9.23956 7.00028 12C7.00028 14.7629 9.23981 17 12.0003 17C14.7632 17 17.0003 14.7605 17.0003 12C17.0003 9.23713 14.7607 7.00003 12.0003 7.00003ZM12.0003 9.00003C13.6572 9.00003 15.0003 10.3427 15.0003 12C15.0003 13.6569 13.6576 15 12.0003 15C10.3434 15 9.00028 13.6574 9.00028 12C9.00028 10.3431 10.3429 9.00003 12.0003 9.00003ZM17.2503 5.50003C16.561 5.50003 16.0003 6.05994 16.0003 6.74918C16.0003 7.43843 16.5602 7.9992 17.2503 7.9992C17.9395 7.9992 18.5003 7.4393 18.5003 6.74918C18.5003 6.05994 17.9386 5.49917 17.2503 5.50003Z"></path></svg>
                                        صفحه اینستاگرام
                                    </a>
                                    <a href='https://t.me/+dr25Y_Q_1fczYTFk' className='flex items-center gap-2 hover:text-accent transition-all'>
                                        <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 24 24" fill="currentColor" className='text-accent w-5'><path d="M12.001 22C6.47813 22 2.00098 17.5228 2.00098 12C2.00098 6.47715 6.47813 2 12.001 2C17.5238 2 22.001 6.47715 22.001 12C22.001 17.5228 17.5238 22 12.001 22ZM8.89113 13.1708L8.90378 13.1628C9.48351 15.0767 9.77337 16.0337 9.77337 16.0337C9.88564 16.3442 10.04 16.3996 10.2273 16.3743C10.4145 16.3489 10.5139 16.2476 10.6361 16.1297C10.6361 16.1297 11.0324 15.7472 11.825 14.9823L14.3759 16.8698C14.8407 17.1266 15.1763 16.9941 15.2917 16.4377L16.9495 8.61641C17.1325 7.88842 16.8115 7.59644 16.247 7.82754L6.51397 11.5871C5.84996 11.854 5.85317 12.2255 6.39308 12.3911L8.89113 13.1708Z"></path></svg>                               کانال تلگرام
                                    </a>
                                    <a href='https://www.linkedin.com/company/alborz-institute/' className='flex items-center gap-2 hover:text-accent transition-all'>
                                        <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 24 24" fill="currentColor" className='text-accent w-5'><path d="M18.3362 18.339H15.6707V14.1622C15.6707 13.1662 15.6505 11.8845 14.2817 11.8845C12.892 11.8845 12.6797 12.9683 12.6797 14.0887V18.339H10.0142V9.75H12.5747V10.9207H12.6092C12.967 10.2457 13.837 9.53325 15.1367 9.53325C17.8375 9.53325 18.337 11.3108 18.337 13.6245V18.339H18.3362ZM7.00373 8.57475C6.14573 8.57475 5.45648 7.88025 5.45648 7.026C5.45648 6.1725 6.14648 5.47875 7.00373 5.47875C7.85873 5.47875 8.55173 6.1725 8.55173 7.026C8.55173 7.88025 7.85798 8.57475 7.00373 8.57475ZM8.34023 18.339H5.66723V9.75H8.34023V18.339ZM19.6697 3H4.32923C3.59498 3 3.00098 3.5805 3.00098 4.29675V19.7033C3.00098 20.4202 3.59498 21 4.32923 21H19.6675C20.401 21 21.001 20.4202 21.001 19.7033V4.29675C21.001 3.5805 20.401 3 19.6675 3H19.6697Z"></path></svg>
                                        لینکدین
                                    </a>
                                </div>

                            </div>

                        </div>
                    </div>

                </div>
            </footer>
            <p className='text-xs sm:text-base p-3 text-center font-Dana bg-zinc-100 tracking-tight'>- تمامی حقوق این سایت متعلق به مجتمع فنی مهندسی البرز می باشد.</p>
        </>
    )
}

export default Footer